---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchWasDeleted
source: html/05427cb8-1925-8382-8d74-da0b2cd66853.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchWasDeleted Property

Sketch was deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchWasDeleted { get; }
```